using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using LibraryFastDecisions;
using static System.Console;

namespace _4_TaskOfTheExam
{
    class Program
    {
        static void Main(string[] args)
        {
            var arrayEng_NumSymbol2 = new HashSet<char>()
            {
                'q','w','e','r','t','y','u','i','o','p','a','s','d','f','g','h','j','k','l','z','x','c','v','b','n','m',
                'Q','W','E','R','T','Y','U','I','O','P','A','S','D','F','G','H','J','K','L','Z','X','C','V','B','N','M',
                '1', '2', '3', '4', '5', '6', '7', '8', '9', '0',
            };
            var ex = new Extension();
            var q = new Questions();
            WriteLine("С# - Уровень 1. Задание 5.4");
            WriteLine("Кузнецов");
            WriteLine(
                "4. Задача ЕГЭ." + Environment.NewLine +
                "   * На вход программе подаются сведения о сдаче экзаменов учениками 9 - х классов некоторой средней" + Environment.NewLine +
                "   школы.В первой строке сообщается количество учеников N, которое не меньше 10, но не" + Environment.NewLine +
                "   превосходит 100, каждая из следующих N строк имеет следующий формат:" + Environment.NewLine +
                "   < Фамилия > < Имя > < оценки >," + Environment.NewLine +
                "     где < Фамилия > — строка, состоящая не более чем из 20 символов, < Имя > — строка, состоящая не" + Environment.NewLine +
                "   более чем из 15 символов, < оценки > — через пробел три целых числа, соответствующие оценкам по" + Environment.NewLine +
                "   пятибалльной системе. < Фамилия > и<Имя>, а также < Имя > и < оценки > разделены одним пробелом." + Environment.NewLine +
                "   Пример входной строки:" + Environment.NewLine +
                "   Иванов Петр 4 5 3" + Environment.NewLine +
                "      Требуется написать как можно более эффективную программу, которая будет выводить на экран" + Environment.NewLine +
                "   фамилии и имена трёх худших по среднему баллу учеников.Если среди остальных есть ученики," + Environment.NewLine +
                "   набравшие тот же средний балл, что и один из трёх худших, следует вывести и их фамилии и имена." + Environment.NewLine +
                "   Достаточно решить 2 задачи.Старайтесь разбивать программы на подпрограммы.Переписывайте в" + Environment.NewLine +
                "   начало программы условие и свою фамилию.Все программы сделать в одном решении.Для решения" + Environment.NewLine +
                "   задач используйте неизменяемые строки(string)");
            
            var cl9 = new ClassInTheSchools(30);
            ex.Print("Список худших студентов 9 класс:", PositionForRow.LeftEdge, CursorTop + 1);
            ex.Print(cl9.ListOfWorstStudents(3), PositionForRow.LeftEdge, CursorTop + 1);

            ex.Pause();
        }
    }

    /// <summary>
    /// Класс школы
    /// </summary>
    class ClassInTheSchools
    {
        private string students = "";
        public string Students { get => students; set => students = value; }
        private Dictionary<double, List<Student>> rating = new Dictionary<double, List<Student>>();
        private SortedSet<double> ratation = new SortedSet<double>();

        /// <summary>
        /// Сгенерировать класс из N учащихся
        /// </summary>
        /// <param name="numberOfStudents"></param>
        public ClassInTheSchools(int numberOfStudents)
        {
            if (10 <= numberOfStudents && numberOfStudents <= 100)
            {
                var allName = new string[]
                {
                    "Аарон", "Абрам", "Август", "Августин", "Авксентий", "Авраам", "Агап", "Агафон", "Адис", "Адольф", "Азарий", "Азат", "Айрат", "Акакий", "Алан", "Алевтин", "Алексий", "Ален", "Алмаз", "Алоис", "Альфред", "Амадей", "Амвросий", "Амин", "Анвар", "Ангел", "Андрон", "Андрэ", "Анисим", "Антип", "Ануфрий", "Анфим", "Арам", "Арий", "Арман", "Армен", "Арон", "Арсен", "Артамон", "Артем", "Архип", "Архипп", "Афанасий", "Афиноген", "Бахрам", "Бежен", "Бернар", "Богдан", "Бонифаций", "Бореслав", "Боян", "Бронислав", "Вадим", "Валентин", "Вальдемар", "Вальтер", "Варлам", "Варфоломей", "Вацлав", "Велизар", "Венедикт", "Вениамин", "Вилен", "Вилли", "Виталий", "Витаутас", "Владимир", "Владислав", "Власий", "Володар", "Вячеслав", "Гавриил", "Гайдар", "Галактион", "Гаспар", "Гастон", "Геворг", "Геласий", "Генри", "Генрих", "Герасим", "Герман", "Гоар", "Гордей", "Градимир", "Граф", "Густав", "Давид", "Дамиан", "Дамир", "Данила", "Данислав", "Дементий", "Демид", "Денис", "Джамал", "Джозеф", "Джордан", "Дик", "Димитрий", "Диомид", "Дмитрий", "Донат", "Донатос", "Евграф", "Евдоким", "Евсей", "Евстафий", "Елизар", "Елисей", "Еремей", "Ермак", "Ерофей", "Ефим", "Жан", "Ждан", "Закир", "Замир", "Захария", "Зенон", "Зорий", "Зосима", "Иакинф", "Ибрагим", "Игнатий", "Игорь", "Израиль", "Изяслав", "Илларион", "Ильхам", "Ильяс", "Иннокентий", "Иоанн", "Ион", "Иосиф", "Ипполит", "Ириней", "Ириний", "Исаакий", "Исай", "Искандер", "Ислам", "Июлий", "Казбек", "Камиль", "Капитон", "Карл", "Каспар", "Кир", "Кирилл", "Клемент", "Клементий", "Клод", "Кондрат", "Конрад", "Константин", "Краснослав", "Ксаннф", "Лавр", "Лаврентий", "Лев", "Леван", "Леон", "Леонард", "Леопольд", "Лермонт", "Лукий", "Лукьян", "Людвиг", "Люсьен", "Магистриан", "Мадлен", "Макар", "Макарий", "Максимилиан", "Максимильян", "Мануил", "Мар", "Марин", "Марк", "Марсель", "Мартин", "Махмуд", "Мелентий", "Мечеслав", "Мечислав", "Милан", "Милен", "Мирон", "Мирослав", "Митя", "Михаил", "Модест", "Моисей", "Муслим", "Мухаммед", "Назарий", "Наиль", "Неонил", "Нестор", "Никифор", "Никодим", "Никон", "Нил", "Нифонт", "Новомир", "Овидий", "Октябрь", "Олесь", "Ольгерд", "Орест", "Орландо", "Остап", "Остромир", "Панкрат", "Пантелеймон", "Парфений", "Пахом", "Пимен", "Платон", "Прозор", "Прокопий", "Прохор", "Равиль", "Радислав", "Радомир", "Разумник", "Раис", "Рамазан", "Рамиз", "Ранель", "Расим", "Ратмир", "Рафаил", "Рашид", "Рем", "Рифат", "Рихард", "Родион", "Ролан", "Рубен", "Рудольф", "Руфин", "Рушан", "Савва", "Савел", "Самсон", "Самуил", "Светозар", "Светослав", "Святослав", "Севастьян", "Северьян", "Семен", "Сидор", "Сильвестр", "Сократ", "Соломон", "Стакрат", "Сталий", "Степан", "Стефан", "Султан", "Тагир", "Талик", "Тамаз", "Тельман", "Тельнан", "Тибор", "Тиграм", "Тимон", "Тимофей", "Тихомир", "Тихон", "Трофим", "Тунгуз", "Устин", "Фаддей", "Фанис", "Фарид", "Федосей", "Федот", "Феодосий", "Фердинанд", "Филимон", "Филипп", "Франц", "Фред", "Фуад", "Хабиб", "Христиан", "Христос", "Чарльз", "Чеслав", "Шамиль", "Шарль", "Щеголь", "Эдвард", "Эдуард", "Эльдар", "Эммануил", "Эраст", "Юлиан", "Юлий", "Юстин", "Юхим", "Якун", "Ян", "Ярослав", "Ясон",
                };

                var allSurname = new string[]
                {
                    "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев", "Киселев", "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов", "Жуков", "Баранов", "Филиппов", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров", "Матвеев", "Титов", "Марков", "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов", "Гаврилов", "Тихонов", "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов", "Мартынов", "Ефимов", "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов", "Родионов", "Коновалов", "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев", "Кудрявцев", "Прохоров", "Наумов", "Потапов", "Журавлев", "Овчинников", "Трофимов", "Леонов", "Соболев", "Ермаков", "Колесников", "Гончаров", "Емельянов", "Никифоров", "Грачев", "Котов", "Гришин", "Ефремов", "Архипов", "Громов", "Кириллов", "Малышев", "Панов", "Моисеев", "Румянцев", "Акимов", "Кондратьев", "Бирюков", "Горбунов", "Анисимов", "Еремин", "Тихомиров", "Галкин", "Лукьянов", "Михеев", "Скворцов", "Юдин", "Белоусов", "Нестеров", "Симонов", "Прокофьев", "Харитонов", "Князев", "Цветков", "Левин", "Митрофанов", "Воронов", "Аксенов", "Софронов", "Мальцев", "Логинов", "Горшков", "Савин", "Краснов", "Майоров", "Демидов", "Елисеев", "Рыбаков", "Сафонов", "Плотников", "Демин", "Хохлов", "Фадеев", "Молчанов", "Игнатов", "Литвинов", "Ершов", "Ушаков", "Дементьев", "Рябов", "Мухин", "Калашников", "Леонтьев", "Лобанов", "Кузин", "Корнеев", "Евдокимов", "Бородин", "Платонов", "Некрасов", "Балашов", "Бобров", "Жданов", "Блинов", "Игнатьев", "Коротков", "Муравьев", "Крюков", "Беляков", "Богомолов", "Дроздов", "Лавров", "Зуев", "Петухов", "Ларин", "Никулин", "Серов", "Терентьев", "Зотов", "Устинов", "Фокин", "Самойлов", "Константинов", "Сахаров", "Шишкин", "Самсонов", "Черкасов", "Чистяков", "Носов", "Спиридонов", "Карасев", "Авдеев", "Воронцов", "Зверев", "Владимиров", "Селезнев", "Нечаев", "Кудряшов", "Седов", "Фирсов", "Андрианов", "Панин", "Головин", "Терехов", "Ульянов", "Шестаков", "Агеев", "Никонов", "Селиванов", "Баженов", "Гордеев", "Кожевников", "Пахомов", "Зимин", "Костин", "Широков", "Филимонов", "Ларионов", "Овсянников", "Сазонов", "Суворов", "Нефедов", "Корнилов", "Любимов", "Львов", "Горбачев", "Копылов", "Лукин", "Токарев", "Кулешов", "Шилов", "Большаков", "Панкратов", "Родин", "Шаповалов", "Покровский", "Бочаров", "Никольский", "Маркин", "Горелов", "Агафонов", "Березин", "Ермолаев", "Зубков", "Куприянов", "Трифонов", "Масленников", "Круглов", "Третьяков", "Колосов", "Рожков", "Артамонов", "Шмелев", "Лаптев", "Лапшин", "Федосеев", "Зиновьев", "Зорин", "Уткин", "Столяров", "Зубов", "Ткачев", "Дорофеев", "Антипов", "Завьялов", "Свиридов", "Золотарев", "Кулаков", "Мещеряков", "Макеев", "Дьяконов", "Гуляев", "Петровский", "Бондарев", "Поздняков", "Панфилов", "Кочетков", "Суханов", "Рыжов", "Старостин", "Калмыков", "Колесов", "Золотов", "Кравцов", "Субботин", "Шубин", "Щукин", "Лосев", "Винокуров", "Лапин", "Парфенов", "Исаков", "Голованов", "Коровин", "Розанов", "Артемов", "Козырев", "Русаков", "Алешин", "Крючков", "Булгаков", "Кошелев", "Сычев", "Синицын", "Черных", "Рогов", "Кононов", "Лаврентьев", "Евсеев", "Пименов", "Пантелеев", "Горячев", "Аникин", "Лопатин", "Рудаков", "Одинцов", "Серебряков", "Панков", "Дегтярев", "Орехов", "Царев", "Шувалов", "Кондрашов", "Горюнов", "Дубровин", "Голиков", "Курочкин", "Латышев", "Севастьянов", "Вавилов", "Ерофеев", "Сальников", "Клюев", "Носков", "Озеров", "Кольцов", "Комиссаров", "Меркулов", "Киреев", "Хомяков", "Булатов", "Ананьев", "Буров", "Шапошников", "Дружинин", "Островский", "Шевелев", "Долгов", "Суслов", "Шевцов", "Пастухов", "Рубцов", "Бычков", "Глебов", "Ильинский", "Успенский", "Дьяков", "Кочетов", "Вишневский", "Высоцкий", "Глухов", "Дубов", "Бессонов", "Ситников", "Астафьев", "Мешков", "Шаров", "Яшин", "Козловский", "Туманов", "Басов", "Корчагин", "Болдырев", "Олейников", "Чумаков", "Фомичев", "Губанов", "Дубинин", "Шульгин", "Касаткин", "Пирогов", "Семин", "Трошин", "Горохов", "Стариков", "Щеглов", "Фетисов", "Колпаков", "Чесноков", "Зыков", "Верещагин", "Минаев", "Руднев", "Троицкий", "Окулов", "Ширяев", "Малинин", "Черепанов", "Измайлов", "Алехин", "Зеленин", "Касьянов", "Пугачев", "Павловский", "Чижов", "Кондратов", "Воронков", "Капустин", "Сотников", "Демьянов", "Косарев", "Беликов", "Сухарев", "Белкин", "Беспалов", "Кулагин", "Савицкий", "", "Жаров", "Хромов", "Еремеев", "Карташов", "Астахов", "Русанов", "Сухов", "Вешняков", "Волошин", "Козин", "Худяков", "Жилин", "Малахов", "Сизов", "Ежов", "Толкачев", "Анохин", "Вдовин", "Бабушкин", "Усов", "Лыков", "Горлов", "Коршунов", "Маркелов", "Постников", "Черный", "Дорохов", "Свешников", "Гущин", "Калугин", "Блохин", "Сурков", "Кочергин", "Греков", "Казанцев", "Швецов", "Ермилов", "Парамонов", "Агапов", "Минин", "Корнев", "Черняев", "Гуров", "Ермолов", "Сомов", "Добрынин", "Барсуков", "Глушков", "Чеботарев", "Москвин", "Уваров", "Безруков", "Муратов", "Раков", "Снегирев", "Гладков", "Злобин", "Моргунов", "Поликарпов", "Рябинин", "Судаков", "Кукушкин", "Калачев", "Грибов", "Елизаров", "Звягинцев", "Корольков", "Федосов",
                };

                var r = new Random();
                var sb = new StringBuilder();
                sb.Append(numberOfStudents + Environment.NewLine);
                var name = "";
                var surname = "";
                var score1 = 0;
                var score2 = 0;
                var score3 = 0;
                var rat = 0.0;
                for (var i = 0; i < numberOfStudents; ++i)
                {
                    name = allName[r.Next(0, allName.Length - 1)];
                    surname = allSurname[r.Next(0, allSurname.Length - 1)];
                    score1 = r.Next(2, 5);
                    score2 = r.Next(2, 5);
                    score3 = r.Next(2, 5);
                    rat = Math.Round(((double)score1 + (double)score2 + (double)score3) / 3.0, 3);
                    if (rating.ContainsKey(rat))
                    {
                        rating[rat].Add(new Student(name, surname, score1, score2, score3));
                    }
                    else
                    {
                        rating.Add(rat, new List<Student>() { new Student(name, surname, score1, score2, score3) });
                        ratation.Add(rat);
                    }

                    sb.Append($"{name} {surname} {score1} {score2} {score3}" + Environment.NewLine);
                }

                Students = sb.ToString();
            }
            else            
                throw new ArgumentException("Число учащихся не соответствует необходимому диапазону от 10 до 100.");
        }

        /// <summary>
        /// Получить список худших учеников класса
        /// </summary>
        /// <param name="numberOfStudents"></param>
        /// <returns></returns>
        public string ListOfWorstStudents(int numberOfStudents)
        {
            var step = 0;
            var sb = new StringBuilder();

            foreach(var r in ratation)
            {
                if (step == numberOfStudents)
                    break;

                sb.Append($"Рейтинг {r} ({rating[r].Count}):" + Environment.NewLine);

                foreach(var s in rating[r])
                    sb.Append($"   {s.Name} {s.Surname} с оценками: {s.Score1}, {s.Score2}, {s.Score3}," + Environment.NewLine);
                step++;
            }

            return sb.ToString();
        }

        /// <summary>
        /// Учащийся
        /// </summary>
        struct Student
        {
            public string Name;
            public string Surname;
            public int Score1;
            public int Score2;
            public int Score3;

            public Student(string name, string surname, int score1, int score2, int score3)
            {
                Name = name;
                Surname = surname;
                Score1 = score1;
                Score2 = score2;
                Score3 = score3;
            }
        }
    }
}
